INSERT INTO
    vocab_ds_zh (term, translation_zh)
VALUES
    (
        'abandon',
        'v. 1. 抛弃，放弃 2. 离弃(家园、船只、飞机等) 3. 遗弃(妻、子女等)'
    ),
    ('abnormal', 'adj. 不正常的'),
    ('abolish', 'n. 废除，消除 v. 废除，取消'),
    (
        'abortion',
        'n. 1. 流产，小产，堕胎 2. (计划、工程等的)中途失败;中止，中辍的计划'
    ),
    ('abrupt', 'adj. 1. 突然的，出其 不意的 2. 陡峭的 3. 粗鲁的，无礼的'),
    ('absence', 'n. 1. 缺席 2. 缺乏，不存在'),
    ('absorb', 'v. 1. 吸收(水、热、光等) 2. 吸引(注意)，使专心，使全神贯注'),
    (
        'abstract',
        'adj. 抽象的 n. 摘要，概括 v. 1. 提取，抽取 2. 摘录…的要点 3. 转移…(注意等)'
    ),
    ('absurd', 'adj. 不合理的，荒谬的，可笑的'),
    ('abundance', 'n. 丰富，充裕，大量'),
    (
        'abundant',
        'adj. 大量的，充裕的，丰富的 || be abundant in, be abundant with 有丰富的，有大量的'
    ),
    (
        'abuse',
        'v. 1. 辱骂，咒骂 2. 滥用，妄用 3. 虐待 n. 1. 辱骂，咒骂 2. 滥用，妄用 3. 虐待 4. 弊病，恶习'
    ),
    ('academic', 'adj. 1. 学校的，学院的 2. 学者式的，非实用的 3. 学术的'),
    ('accelerate', 'v. (使)加速'),
    ('acceptance', 'n. 接受，领受'),
    (
        'access',
        'n. 1. (接近或进入某地的)方法，通路 2. (使用某物或接近某人的)机会或权利 v. 存取(计算机文件)'
    ),
    ('accessory', 'n. 附属品，附件'),
    (
        'accident',
        'n. 意外事件 || by accident偶然地 /without accident平安无事地'
    ),
    (
        'accommodate',
        'v. 1. 容纳，接纳，提供…住宿 2. 使适应，使适合，调节 3. 帮助解决(困难)'
    ),
    ('accommodation', 'n. (usu pl) 住宿等条件，设施'),
    ('accomplish', 'v. 完成，实现，达到(目的)'),
    (
        'accord',
        'v. 符合，一致 n. 协调，一致 || of one’s own accord自愿地，自动地'
    ),
    ('accordance', 'n. 符合，一致 || in accordance with根据'),
    (
        'account',
        'n. 1. 账，账目，账户 2. 报道，记载，叙述 3. 原因，理由 || on account of 因为 /take into account考虑，重视'
    ),
    ('accumulate', 'v. 积蓄，积累'),
    ('accurate', 'adj. 准确的，精确的'),
    ('accuse', 'v. 1. 指责，谴责 2. 控诉，控告'),
    ('accustomed', 'a. 惯常的，习惯了的'),
    ('achievement', 'n. 1. 完成，达到 2. 成就，成绩'),
    (
        'acid',
        'adj. 1. 酸味的，苦味的 2. 尖刻的 n. 1. 酸(含氢的化学物质) 2. 迷幻药'
    ),
    ('acknowledge', 'v. 1. 承认 2. 告知收到(信件、礼物等) 3. 表示感谢'),
    ('acquaint', 'v. 使认识，使了解'),
    ('acquaintance', 'n. 1. 相识，了解 2. 相识的人，熟人'),
    ('acquire', 'v. 1. 取得，获得，习得 2. 学到(知识等)'),
    ('activate', 'v. 1. 使活动，使活跃，使积极 2. 刺激，激化'),
    (
        'acute',
        'adj. 1. 尖锐的，锐角的 2. 激烈的，严重的 3. 敏锐的 4. (疾病)急性的，(疼痛)剧烈的'
    ),
    ('adapt', 'v. 1. 使适应，适合 2. 改编，改写'),
    ('addict', 'n. 1. 有瘾的人 2. 对某事有强烈兴趣的人'),
    ('addition', 'n. 加，加法 || in addition (to)另外，除…之外'),
    ('additional', 'adj. 附加的，追加的，另外的'),
    ('adequate', 'adj. 适当的，充分的，足够的'),
    ('adhere', 'v. 1. 粘附， 粘着 2. 坚持，遵循'),
    ('adjacent', 'adj. 邻近的'),
    ('adjoin', 'v. 贴近，相接'),
    ('adjust', 'v. 1. 整顿，整理，安排 2. 使适应于(新环境等)'),
    ('administration', 'n. 1. (行政)管理 2. (AmE)政府'),
    (
        'admit',
        'v. 1. 允许(人或物)进入 2. 承认，供认，招认 3. (指在一范围内)可容纳(某人或某事) || admit of …容纳得下，有…的余地'
    ),
    ('adolescent', 'adj. 青少年期的 n. 青少年'),
    (
        'adopt',
        'v. 1. 采用，采纳，采取(态度等) 2. 收养 3. 接受某种习俗 4. 正式通过'
    ),
    ('adore', 'v. 1. 敬慕，钟爱，崇拜 2. (infml)很喜欢'),
    (
        'advantage',
        'n. 优势，益处，利益 || take advantage of利用，乘…机 /to one’s advantage对某人有利'
    ),
    ('adverse', 'adj. 不利的，相反的，敌对的'),
    ('advocate', 'v. 拥护，提倡 n. 提倡者，拥护者'),
    ('aerial', 'adj. 1. 空气的，大气的 2. 航空的'),
    ('aesthetic', 'a. 美学的，审美的，有美感的'),
    ('affection', 'n. 慈爱，友爱'),
    ('affiliate', 'v. (指团体)加入(联合),使隶属，附属于'),
    ('affirm', 'v. 1. 坚称，断言，肯定地说'),
    ('afflict', 'v. 使身体(精神)痛苦，折磨'),
    ('aggregate', 'n. 总数，合计'),
    ('aggressive', 'adj. 1. 侵略性的， 攻击性的，爱寻衅的 2. 有进取心的'),
    ('agony', 'n. 1. 极度的痛苦 2. 痛苦的挣扎'),
    ('agreeable', 'adj. 1. 惬意的，爽快的 2. 易相处的 3. 适宜的，适合的'),
    ('aid', 'v. 援助，帮助 n. 1. 援助，帮助，救护 2. 助手，辅助物'),
    ('air-condition', 'v. 设以空调设备，用空调调节'),
    ('aisle', 'n. (教堂、戏院等的)通道，走廊'),
    ('alarm', 'n. 1. 警报 2. 惊恐 v. 1. 向…报警，使警觉 2. 使惊恐'),
    ('album', 'n. 照相簿，邮票册'),
    ('alcohol', 'n. 乙醇，酒精'),
    (
        'alert',
        'adj. 1. 警惕的，警觉的 2. 敏捷的，灵活的 n. 警报 ||on the alert (for)警惕着，对…保持戒备(状态) v. 向…发出警报'
    ),
    ('alien', 'n. 外侨，外国人 adj. 1. 外国的，异邦的 2. 敌对的'),
    ('alienate', 'v. 使疏远，离间'),
    ('allege', 'v. (在提不出证明的情况下)断言，声称'),
    ('alleviate', 'v. 缓和，减轻(痛苦等)'),
    ('alliance', 'n. 同盟，联盟'),
    ('allocate', 'v. 分配，配给'),
    ('alloy', 'n. 合金'),
    ('alter', 'v. 变动'),
    ('alternate', 'adj. 交替的，轮流的，交错的 v. (使)交替，(使)轮流'),
    (
        'alternative',
        'adj. 1. 两者(或两者以上)选一的，另一可供选择的 2. 选择性的 n. 1. 取舍，抉择 2. 替换物，可供选择的方法'
    ),
    ('ambiguous', 'adj. 模棱两可的，意义不明确的'),
    ('ambition', 'n. 1. 志向，抱负，雄心 2. 野心，奢望'),
    ('ambitious', 'adj. 1. 有雄心的，野心勃勃的 2. 劲头十足的'),
    ('amend', 'v. 修改，修正，改进'),
    ('ammunition', 'n. 弹药'),
    ('amplify', 'v. 1. 详述，详加解说 2. 放大(声音等)，增强(音量)'),
    ('analogy', 'n. 1. 相似，类似 2. 类推，类比，比拟'),
    ('analyse', 'v. 分析，细察，分解'),
    (
        'analysis',
        'n. 分析，分解 || in the last (final) analysis归根结底，总而言之'
    ),
    ('ancestor', 'n. 祖先，祖宗'),
    ('ancient', 'adj. 古代的，古老的，古式的'),
    ('annoy', 'v. 1. 使烦恼，使生气 2. 打搅'),
    ('annual', 'adj. 每年的，年度的'),
    ('anonymous', 'adj. 无名的，不具名的'),
    (
        'anticipate',
        'v. 1. 预期，预料，期待 2. 抢先行动，先发制人 3. 预先考虑到，料到…并采取行动'
    ),
    ('anxiety', 'n. 1. 忧虑，担心，焦虑 2. 渴望，热望'),
    ('apartment', 'n. 1. 一套房间 2. 一套公寓房间'),
    ('apology', 'n. 1. 道歉，认错，谢罪 2. (为信仰等的)辩解'),
    ('apparatus', 'n. 器械，设备'),
    ('appeal', 'n. 1. 感染力，吸引力 2. 恳求，呼吁 3. 上诉'),
    ('appearance', 'n. 1. 出现，出场，露面 2. 外貌，外观，外表'),
    ('appease', 'v. 使满足，平息，抚慰'),
    ('appendix', 'n. 1. 附录 2. 末尾 3. 阑尾'),
    ('applaud', 'v. 1. 鼓掌，欢迎，欢呼 2. 赞成，称赞'),
    ('appliance', 'n. 器具，机械，装置'),
    (
        'application',
        'n. 1. 请求，申请，申请表 2. 应用，适用，运用 3. 施用，敷用药等'
    ),
    ('apply', 'v. 1. 申请，请求 2. 应用，施用，运用 3. 适用'),
    ('appraisal', 'n. 评定，鉴定，评价'),
    (
        'approach',
        'v. 1. 靠近，接近 2. 与…打交道 3. 探讨，看待，处理 n. 1. 靠近，接近 2. 探讨，态度，方法'
    ),
    ('appropriate', 'adj. 适合的，适宜的'),
    ('approve', 'v. 1. 批准，通过 2. 赞成，称许'),
    ('apt', 'adj. 1. 恰当的，贴切的 2. 易于…的'),
    ('arbitrary', 'adj. 1. 随意的，武断的 2. 霸道的，专横的'),
    ('arc', 'n. 弧线，弧形'),
    (
        'arena',
        'n. 1. (古罗马圆形剧场中央的)竞技场地，竞技场 2. 活动场所，竞争场所'
    ),
    ('argue', 'v. 辩论，争论'),
    ('armor', 'n. 盔甲，潜水服，装甲 v. 为……装甲'),
    ('arouse', 'v. 1. 唤醒 2. 唤起，激起，引起(注意、同情、嫉妒、怀疑等)'),
    ('arrange', 'v. 1. 整理，分类，排列 2. 筹备，安排 3. 商妥，商定'),
    ('arrangement', 'n. 1. 整理，排列，布置 2. 安排，准备，筹备 3. 商定'),
    (
        'array',
        'n. 1. 展示，陈列 2. 排列整齐的一队人，一长列(物品) 3. (特殊场合穿的)盛装'
    ),
    ('arrest', 'v. 1. 逮捕，拘留，扣留 2. 抓住，吸引 3. 阻止，阻碍，抑制'),
    ('arrogant', 'adj·傲慢无礼的，骄傲自大的'),
    ('artery', 'n. 1. 动脉 2. 干线，要道(道路、铁路等)'),
    ('articulate', 'v. 1. 清楚明白地表 2. 用关节连接'),
    ('artificial', 'adj. 1. 人造的，人工的 2. 假装的，不自然的'),
    ('artillery', 'n. 大炮，炮兵部队'),
    ('ascend', 'v. 登高，上升，升高'),
    ('ascertain', 'v. 发现，查明，确定'),
    ('ascribe', 'v. 把…归因于，认为…是某人所做'),
    ('aspect', 'n. 1. 方面 2. 面貌，外表'),
    ('aspiration', 'n. 渴望，志向，抱负'),
    ('assassination', 'n. 暗杀，行刺'),
    (
        'assault',
        'n. 猛烈地攻击，突击，突袭 v. 1. 突击，袭击 2. 殴打 3. 强奸'
    ),
    ('assemble', 'v. 1. 聚集，集合 2. 装配(机器等)'),
    ('assert', 'v. 1. 宣称，断言 2. 维护，坚持(权利等)'),
    ('assess', 'v. 评估(价值或数额)，评定，核定'),
    ('asset', 'n. 1. 资产，财产 2. 有价值的特性(技能)'),
    (
        'assign',
        'v. 1. 分配 (房屋、土地、工作、任务等) 2. 指定(时间、地点等) 3. 委派，指派'
    ),
    ('assignment', 'n. 1. 分配，委派 2. (分派)的任务，指定的(课外)作业'),
    ('assimilate', 'v. 1. 消化，吸收(食物、思想等) 2. 使…同化'),
    ('assistance', 'n. 援助，帮助'),
    ('associate', 'v. 1. 结交，交往 2. 使联合 3. 联想 n. 同事，同伴'),
    ('association', 'n. 1. 联合，联盟 2. 联想 3. 协会，社团'),
    (
        'assume',
        'v. 1. 假定，设想 2. 承担，接受 3. 装出，佯作 || assuming that… 假定…'
    ),
    ('assumption', 'n. 1. 假定，假设 2. 假装'),
    ('assurance', 'n. 1. 担保，保证 2. 肯定，确信 3. 自信'),
    ('assure', 'v. 1. 使确信，使放心，向…保证 2. 保障'),
    ('athlete', 'n. 运动员'),
    ('atlas', 'n. 地图册'),
    ('atmosphere', 'n. 1. 空气 2. 大气，大气层 3. 气氛，环境'),
    ('attach', 'v. 1. 缚，系，贴 2. 参加(党派) 3. 把(重点等)放在'),
    ('attack', 'n. 攻击，进攻，攻打 v. 攻击，进攻，侵袭'),
    ('attain', 'v. 1. 达到，完成，获得，实现 2. 到达，至'),
    (
        'attempt',
        'v. 试做，尝试，企图 n. 1. 尝试，企图 2. 试做的事，未成功的事 3. 攻击，侵害'
    ),
    ('attendant', 'n. 1. 侍者，服务员 2. 护理员'),
    ('attitude', 'n. 1. 态度，看法 2. 姿势'),
    ('attract', 'v. 1. 引起…的注意(兴趣) 2. 吸引'),
    ('attractive', 'adj. 有吸引力的，诱人的，令人愉快的'),
    (
        'attribute',
        'v. 把…归因于 || attribute to把…归于; n. 1. 性质，属性，特质 2. 人(地位)的象征(标志)'
    ),
    ('auction', 'n. 拍卖 v. 以拍卖方式出售，拍卖'),
    ('audience', 'n. 1. 听众，观众 2. 接见，会见'),
    ('authentic', 'adj. 真正的，真迹的，原作的，正宗的'),
    ('author', 'n. 1. 著者，作家 2. 创造者，创始人，发起人'),
    ('authoritative', 'adj. 具权威性的，可信赖的'),
    (
        'authority',
        'n. 1. 权，权力 2. 权威 3. (pl art)当局，官方 4. 职权，权限'
    ),
    ('authorize', 'v. 授权，批准，委托'),
    ('autonomous', 'adj. 自治的，自主的，有自治权的'),
    ('autonomy', 'n. 自治，自治权'),
    ('avail', 'v. 利用'),
    ('available', 'adj. 可用的，可得到的'),
    ('avert', 'v. 1. 防止，避免 2. 移开(目光)，避开不看'),
    ('aviation', 'n. 航空，航空学'),
    ('avoid', 'v. 避免，回避，躲开'),
    ('award', 'v. 授予，给以奖励 n. 奖品'),
    ('aware', 'adj. 知晓，察觉，意识到'),
    (
        'awkward',
        'adj. 1. 笨拙的，不熟练的 2. 使用不便的 3. 尴尬的 4. 难应付的，难 处理的'
    ),
    ('axis', 'n. 1. 轴，轴心 2. 轴线'),
    ('background', 'n. 1. 背景 2. 个人的背景资料'),
    ('bacteria', 'n. 细菌'),
    ('ballet', 'n. 芭蕾舞(曲、剧、团)'),
    ('bamboo', 'n. 竹子，竹竿'),
    (
        'band',
        'n. 1. 一帮，一伙(人) 2. 乐队 3. 带，带形物，箍 4. 镶边，嵌条 5. (收音机)波段，频带 v. 1. 用带绑扎 2. 联合'
    ),
    ('bandage', 'n. 绷带 v. 用绷带包扎'),
    (
        'bang',
        'v. 1. 猛撞，猛敲 2. 砰的关上(门等) 3. 发出砰的一声 n. 1. 猛击 2. 砰的一响'
    ),
    ('banquet', 'n. 宴会 v. 宴请，参加宴会'),
    ('barely', 'adv. 勉强，好容易才'),
    (
        'bargain',
        'v. 议价，讨价还价 n. 1. 廉价货 2. 合同，协议 3. 交易 || drive a bargain讨价还价'
    ),
    (
        'barren',
        'adj. 1. (土地)贫瘠的 2. 不孕的，不育的，不结果实的 3. 无用的，无效果的，无实际内容的'
    ),
    ('barricade', 'n. 路障，街垒 v. 设路障，封闭，拦阻'),
    ('barrier', 'n. 1. 栅栏，篱笆 2. 障碍，障碍物'),
    ('basis', 'n. 基础，根据 || on the basis of 根据'),
    ('batch', 'n. 一批，一组，一群'),
    ('batter', 'v. 1. 连续猛击，炮击 2. 打烂，用旧'),
    (
        'beam',
        'n. 1. 梁 2. (日光、灯光等)(一)道，(一)束 v. 1. 微笑 2. 发光'
    ),
    ('beforehand', 'adv. 预先，事先'),
    (
        'behave',
        'v. 举动，表现，检点(自己的行为) || Behave yourself! 放规矩点!'
    ),
    ('behavior', 'n. 行为，举止'),
    ('belly', 'n. 1. 腹部 2. 胃部'),
    ('beneficial', 'adj. 有益的，有好处的'),
    (
        'benefit',
        'n. 1. 利益，好处 2. 恩惠 3. 津贴，救济金，保险赔偿费 v. .有益于'
    ),
    ('betray', 'v. 1. 背叛，出卖 2. 辜负，不忠于 3. 泄露(秘密等)'),
    ('bewilder', 'v. 迷惑，把…弄糊涂'),
    (
        'beyond',
        'prep. 1. 在…之外，在…的更远处 2. 到…以后，晚于 3. 超出(能力，范围等) 4. 除了…之外'
    ),
    ('bibliography', 'n. 书目，目录，参考书目'),
    ('biography', 'n. 1. 传记 2. 传记文学'),
    ('bizarre', 'adj. 古怪的，怪诞的'),
    (
        'blank',
        'adj. 1. 空白的 2. 空虚的，单调的 3. 茫然的 4. 失色的，没有表情的 5. 无韵脚的 n. 空白，空格，空页'
    ),
    (
        'blaze',
        'n. 1. 火，火焰 2. 光辉，灿烂 3. 迸发，爆发 v. 1. 燃烧，冒火焰 2. 发光，放光彩 3. 发怒'
    ),
    ('bleed', 'v. 1. 出血，流血 2. 悲痛，同情'),
    ('blink', 'v. 1. (星星)闪烁 2. (眼睛)眨眼'),
    ('blossom', 'n. 花，开花的状态 v. 1. 开花 2. 发展，繁荣，成长'),
    ('blunder', 'n. 错误 v. 弄错，犯大错'),
    (
        'blunt',
        'adj. 1. 钝 host的不锋利的 2. (举止言谈等)生硬的，直率的，不拐弯抹角的 3. (感觉、理解方面)迟钝的 v. 把…弄钝，把…弄迟钝'
    ),
    ('blur', 'n. 模糊不清的事物 v. 使模糊，使看不清楚'),
    ('blush', 'n. 脸红 v. 感到羞愧'),
    ('bonus', 'n. 额外给予的东西，奖金，红利'),
    ('booklet', 'n. 小册子'),
    (
        'boom',
        'v. 1. 隆隆作响，发低沉声 2. 迅速发展，繁荣，兴旺; n. 1. 帆的下析 2. (横于河面阻挡原木漂走或船只航行的)重铁链，水栅，拦河埂'
    ),
    ('booth', 'n. 1. (有篷的)货摊 2. (AmE)公用电话亭 3. (隔开的)小间'),
    (
        'border',
        'n. 1. 边界，国境，边境地区 2. 边，缘，边沿 3. 滚边 v. 接界'
    ),
    ('boring', 'adj. 单调乏味的，令人厌倦的; n. 钻孔，打孔'),
    (
        'bounce',
        'v. 1. (球)反跳，弹起 2. (人)跳(起) 3. 拍(球)，使跳回 4. 使撞击 n. 1. 弹(力) 2. 跳跃，跳动'
    ),
    (
        'bound',
        'n. 界限，范围; v. 1. 跳动，跳跃 2. 跳回，弹回; adj. 开往…的'
    ),
    ('bowel', 'n. 1. 肠，内脏 2. 内部，深处 v. 挖……的内脏'),
    ('boycott', 'v. &n. (联合)抵制'),
    (
        'brace',
        'n. 1. 支柱，支架 2. 一双，一对 3. 大括号{}的前半或后 4. (pl BrE)(裤子)背带=(AmE) suspenders v. 1. 拉紧，系紧 2. 支住，撑牢 3. 激励，振奋 4. 打起精神，下定决心'
    ),
    ('bracket', 'n. 1. 架子 2. (pl)括号'),
    ('brand', 'n. 1. 商标，牌子 2. 烙印， 标记 v. 在…上打烙印，在…上打印记'),
    (
        'breach',
        'n. 1. 违反， 不履行 2. 绝交， 不和 3. 破洞，裂缝 v. 冲破，攻破'
    ),
    ('breakdown', 'n. 崩溃，故障'),
    ('breakthrough', 'n. 1. (敌方防卫线的)突破 2. 重大发现'),
    (
        'breed',
        'n. 品种，种类 v. 1. 繁殖， 育种 2. 饲养 3. 养育，培养，教养'
    ),
    (
        'brew',
        'v. 1. 酿造(啤酒) 2. 泡(茶)，煮(咖啡) 3. 酝酿 n. 1. 酿造物 2. (酿造饮料的)质量，品味'
    ),
    ('bribe', 'n. 贿赂 v. 贿赂，收买'),
    (
        'brief',
        'adj. 1. 简短的，简洁的 2. 短暂的 n. 概要，摘要，短文 || in brief简而言之'
    ),
    ('brilliant', 'adj. 1. 光辉的，辉煌的 2. 卓越的，聪颖的'),
    (
        'brink',
        'n. 1. (峭壁顶上的)边缘，(河流等的)边沿，边 2. 边缘 || on the brink of …濒临，正要…之际'
    ),
    (
        'brisk',
        'adj. 1. 活跃的，轻快的 2. (天气等)清新的，令人爽快的 3. 兴旺的，生气勃勃的 v. 1. 使活泼，使活跃，兴旺 2. 活泼起来，兴旺起来'
    ),
    (
        'bronze',
        'n. 1. 青铜，古铜 2. 青铜制(艺术)品 3. 青铜色 v. (使)变成青铜色'
    ),
    (
        'brood',
        'n. 1. (鸡等)一窝，同窝幼鸟 2. (同类或同种的)一伙，一组(事物) v. 1. 孵(蛋),孵出 2. 盘算，细想，沉思'
    ),
    (
        'bruise',
        'n. 1. (人体、水果或植物等碰撞后产生的)青肿或伤痕 2. (感情等方面)挫伤 v. 1. 使(皮肉)青肿，碰伤(水果、植物等) 2. 碾碎，捣烂(水果等) 3. 挫伤(感情等)'
    ),
    ('brutal', 'adj. 残忍的，兽性的'),
    ('buck', 'n. 雄鹿，雄兔 adj. 雄的'),
    ('bud', 'n. 1. 芽，萌芽状态 2. 蓓蕾'),
    ('budget', 'n. 1. 预算 2. 金额，预算拨款 v. 编制预算，安排开支'),
    (
        'bug',
        'n. 1. 小虫 2. 病菌 3. 窃听器 4. (电脑等的)故障 v. 1. 装窃听器 2. 不断地烦扰，纠缠'
    ),
    ('bulk', 'n. 容量，体积，数量'),
    (
        'bull',
        'n. 公牛 adj. 1. 公的，雄的 2. 哄抬价格的，行情上涨的 v. 1. 强行(使) …通过 2. 从事投机使(证券等)价格上涨'
    ),
    ('bulletin', 'n. 公报，公告'),
    ('bully', 'v. 欺侮，强迫… (做某事) n. 恃强凌弱的人'),
    ('bump', 'v. 1. 碰撞 2. 撞击 3. 颠簸地行驶 n. 1. 碰撞 2. 肿块'),
    ('burden', 'n. 担子，负担'),
    ('bureaucracy', 'n. 1. 官僚制度，官僚体制 2. 官僚作风'),
    ('burial', 'n. 埋葬，葬礼'),
    (
        'bust',
        'n. 1. 半身雕塑像 2. (妇女的)乳房、胸部; adj. (AmE)生意失败，破产，倒闭 || go bust 破产'
    ),
    ('buzz', 'n. 1. 嗡嗡声 2. 嘈杂声 v. 1. 发出嗡嗡声 2. 发出嘈杂声'),
    ('buzz word', 'n. (流行而时髦的)专业词语，技术用语'),
    ('bypass', 'n. (绕过市镇的)旁道，迂回道 v. 绕过，回避'),
    ('cabin', 'n. 1. (简陋的)小屋 2. 船舱，机舱'),
    ('cabinet', 'n. 1. 橱柜 2. 内阁'),
    (
        'cable',
        'n. 1. 缆，索，钢丝绳 2. 电缆，海底电缆，海底电报 v. .拍(海底)电报'
    ),
    ('cafeteria', 'n. 自助餐厅'),
    ('calcium', 'n. 钙'),
    ('calorie', 'n. (热量单位)卡路里'),
    ('cancel', 'v. 1. 取消 2. 删去，省略，划掉'),
    ('cancer', 'n. 癌，癌症'),
    ('candidate', 'n. 1. 候选人 2. 应试者，应考者'),
    ('cane', 'n. 1. 细长而有节的茎 2. 手杖'),
    ('cannon', 'n. 大炮'),
    (
        'canon',
        'n. 1. 教会法规 2. (行为或思想的)规范; 准则 3. (任职大教堂的)教士'
    ),
    ('canvas', 'n. 1. 帆布 2. 画布，油画'),
    ('capable', 'adj. 有能力的，有才能的'),
    ('capacity', 'n. 1. 容量 2. 能力 3. 资格，地位'),
    ('cape', 'n. 1. 披肩 2. 岬，海角'),
    ('capsule', 'n. 1. 药丸，胶囊 2. 太空舱'),
    ('caption', 'n. 图片上的说明文字，(报刊文章的)标题'),
    ('captive', 'n. 俘虏 adj. 被捕的，被监禁的'),
    (
        'cardinal',
        'adj. 1. 主要的，基本的 2. 深红的 n. 1. 深红色 2. 基数 3. 红衣主教'
    ),
    ('carve', 'v. 1. 雕刻 2. 切(熟肉)，切开'),
    (
        'cast',
        'v. 1. 投，掷，抛 2. 投射(光、影等) 3. 投(票) n. 1. 演员的阵容，演员表 2. 铸造，铸型'
    ),
    ('casual', 'adj. 1. 偶然的，碰巧的 2. 随便的 3. 临时的'),
    ('casualty', 'n. 意外或战争中的伤亡者'),
    ('catastrophe', 'n. (突然的)大灾祸，大灾害'),
    ('cater', 'v. 1. 供应伙食，提供娱乐节目，为(宴会等)供应酒菜 2. 迎合，投合'),
    ('cathedral', 'n. 大寺院，大教堂'),
    ('catholic', 'n. 天主教徒 a. 1. 天主教的 2. 普遍的，广泛的，宽宏大量的'),
    ('caution', 'n. 1. 当心，谨慎 2. 告诫，警告 v. 警告，告诫'),
    ('cautious', 'adj. 细心的，谨慎的'),
    ('cavity', 'n. 洞，穴'),
    ('cellar', 'n. 地窖'),
    ('cemetery', 'n. 墓地，公墓'),
    ('census', 'n. 人口调查，人口普查'),
    ('ceramic', 'n. 制陶业，陶器，陶瓷工艺'),
    ('cereal', 'n. 谷类食物，谷物'),
    ('certainty', 'n. 1. 确实性 2. 确实的事'),
    ('certify', 'v. 证明，证实'),
    (
        'challenge',
        'n. 1. 挑战，要求决斗，邀请比赛 2. 异议，质问怀疑 v. 1. 向…挑战 2. 对…表示异议， 非难， 怀疑'
    ),
    ('champagne', 'n. 香槟酒'),
    ('champion', 'n. 1. 冠军，优胜者 2. 拥护者，战士，斗士 v. 拥护，支持'),
    ('chant', 'n. 1. 吟唱 2. 反复的大声说 3. 吟唱的曲调 v. 吟唱，反复说'),
    ('chapel', 'n. (基督教)小教堂'),
    (
        'character',
        'n. 1. 特性，性质，特征 2. (小说，戏剧等)人物，角色 3. 字，书写符号，印刷符号'
    ),
    (
        'characteristic',
        'adj. 特有的，独特的，表示特性的 n. (pl)特性， 特征，特色'
    ),
    ('characterize', 'v. 描绘……的特性，刻划……的性格'),
    (
        'charge',
        'v. 1. 要(价)，收(费)，要(人)支付 2. 冲锋 3. 以某事指控某人，(指在法庭上)控告某人 n. 1. 费用，价钱，应付项目 2. 掌管，照管，监护 3. 负荷，电荷 4. 指控，控告，指责'
    ),
    ('chase', 'v. 追逐追赶，追击 n. 追逐，追赶，追击'),
    ('cherish', 'v. 1. 珍爱 2. 抱有(希望)，怀有(感情)'),
    (
        'chief',
        'adj. 1. 主要的，首要 of the 2. 首席的，主任的 n. 1. 首领，领袖 2. 主任，首长 3. 头目，头子'
    ),
    ('chip', 'n. 碎片，薄片'),
    ('cholesterol', 'n. 胆固醇'),
    ('chord', 'n. 1. 和弦，和音 2. (几何的)弦'),
    (
        'chorus',
        'n. 合唱，合唱队，歌舞团 || in chorus齐声，一齐 v. 合唱，异口同声地说'
    ),
    ('chronic', 'adj. 1. (病症)长期未愈的，慢性的 2. 极坏的，极差的'),
    ('chunk', 'n. 厚厚一片，大块'),
    ('circulation', 'n. 1. 循环 2. 流通，流传 3. (报纸、书刊的)销售量'),
    (
        'circumstance',
        'n. 1. (pl)情况，情形，环境 2. (pl)境况，境遇 || under the circumstances在那种情况下 / under no circumstance无论如何'
    ),
    (
        'circus',
        'n. 1. (圆形的)马戏场，杂技团 2. 马戏(杂技)的表演 3. 马戏团'
    ),
    ('cite', 'v. 引用，引证，举(例)'),
    (
        'claim',
        'v. 1. (根据权利)要求，认领，索取 2. 声声声，主张 n. 1. (根据权利而提出的)要求 2. (对某事物的)权利，所有权'
    ),
    ('clamp', 'n. 钳，夹子 v. 钳紧，夹住'),
    ('clan', 'n. 氏族，家族，宗派'),
    ('clarity', 'n. 清晰，明晰'),
    ('clash', 'v. 1. 冲突，交锋，产生矛盾 2. 发出金属的撞击声 n. 冲突，不一致'),
    (
        'clasp',
        'v. 1. 扣住，扣紧，钩住 2. 拥抱，抱紧 3. 紧握 n. 1. 扣子，钩子 2. 拥抱，紧握'
    ),
    (
        'classic',
        'adj. 1. (文学、艺术等)第一流的，最优秀的，规范的 2. 古典(指古罗马 或古希腊文艺)的，古典派的 3. 在文学史(历史上)著名的 n. 1. 文豪，大艺术家 2. 杰作，名著 3. (pl)经典(著作)，(古罗马或古希腊的)经典著作'
    ),
    ('classical', 'adj. 1. 古典的 2. 传统的，正统的，经典的'),
    ('classification', 'n. 1. 分类，分级 2. 分类法 3. 类别，等级'),
    (
        'clearance',
        'n. 1. 清除，清理 2. 许可(证)，批准 || a clearance sale (商店)清仓大贱卖'
    ),
    ('clerk', 'n. 1. 职员，办事员，书记员 2. 管理员 3. (AmE)店员'),
    (
        'client',
        'n. 1. 委托人，(律师的)当事人，(私人医生的)病人 2. (商店等)顾客'
    ),
    ('cliff', 'n. 悬崖绝壁'),
    ('climate', 'n. 1. 气候 2. 一般(社会)趋势，(社会)风气'),
    (
        'climax',
        'n. 1. 顶点，极点 2. (小说、戏剧等的)高潮 3. 性交的高潮 v. (使)达到顶点，达到高潮'
    ),
    ('cling', 'v. 1. 粘住，缠住 2. 依附，依靠 3. 紧紧握住，紧紧抱住'),
    ('clip', 'v. 剪下，修剪 n. 夹子，纸夹'),
    ('clockwise', 'adv. 顺时针方向地'),
    ('clone', 'n. (动植物)无性繁殖系，纯种细胞 v. (使某物)无性繁殖，克隆'),
    ('closet', 'n. 1. 橱柜 2. 私室，小房间 3. 盥洗室，厕所'),
    ('clue', 'n. 线索'),
    (
        'cluster',
        'n. 一串，一束，一簇，一群，一组 v. 使成群，把…集成一束(一组)，群集，丛生'
    ),
    (
        'clutch',
        'v. 抓住，攫住 n. 1. (pl)爪子，毒手，控制 2. (一把)抓住，攫住'
    ),
    ('coalition', 'n. 政党的联盟，联合'),
    (
        'coarse',
        'adj. 1. 粗的，粗糙的，粗劣的 2. (举动等)粗鲁的，粗暴的，粗俗的'
    ),
    ('cocaine', 'n. 可卡因'),
    (
        'cocktail',
        'n. 1. 鸡尾酒 2. 开胃食品 adj. 鸡尾酒的 || cocktail party鸡尾酒会'
    ),
    ('cognitive', 'adj. 认识(力)的，认知的'),
    ('coherent', 'adj. (言语、思想等)有条理的，连贯的'),
    ('coincide', 'v. 1. 同时发生 2. 一致，不谋而合'),
    ('coincidence', 'n. 巧合，巧事'),
    ('collaboration', 'n. 1. 合作，协作 2. 勾结'),
    ('collapse', 'v. 1. 崩溃，倒塌 2. 病倒，衰败 n. 1. 崩溃 2. 衰败'),
    ('colleague', 'n. 同事，同僚'),
    ('collide', 'v. 1. (车、船等)猛撞 2. 冲突'),
    ('collision', 'n. 碰撞，冲突'),
    (
        'colonial',
        'adj. 1. 殖民地的，关于殖民地的 2. (cap)(美国独立前)十三州时代的，美国初期的 3. 拥有殖民地的'
    ),
    ('combat', 'n. 1. 战斗，格斗，反对 2. 竞争 v. 跟…战斗，反对'),
    (
        'combination',
        'n. 1. 结合，联合，混合，组合 2. 团体，结合体，混合体 3. (开暗码锁的)组合数码(字码)，暗码'
    ),
    (
        'combine',
        'v. 1. 使结合，使联合 2. 合并 3. 使化合 n. 1. 联合企业 2. 联合收割机(=combine harvester)'
    ),
    ('comet', 'n. 彗星'),
    ('comic', 'adj. 滑稽的，喜剧化的 || comic strip连环漫画'),
    (
        'command',
        'v. 1. 指挥，统帅 2. 命令 3. 控制，对…有支配权，拥有…(可供使用) 4. 俯瞰 n. 1. 统帅(地位)，指挥(权) 2. 命令 3. 运用能力 || in command (of)指挥，控制 /take command of (开始)指挥'
    ),
    ('commemorate', 'v. 庆祝，纪念'),
    ('commence', 'v. 开始'),
    ('commend', 'v. 1称赞，赞扬 2. 委托，托付'),
    ('commentary', 'n. 1. (对书籍等的)评语，评注，评论 2. 实况报道'),
    ('commercial', 'adj. 商业(上)的，商务的 n. 电台(电视)中的广告节目'),
    (
        'commission',
        'n. 1. 委任，代办(权) 2. 委任状，委任职权 3. 委员会 4. 佣金 v. 委任，委托'
    ),
    ('commit', 'v. 1. 犯(罪) 2. 委托'),
    ('commitment', 'n. 1. 信奉，献身 2. 承担的义务 3. 承诺，许诺，保证'),
    ('committee', 'n. 委员会'),
    ('commodity', 'n. 商品，日用品'),
    ('commonplace', 'adj. 平凡的，常见的'),
    ('commonwealth', 'n. 1. 全体国民 2. 国家，共和国 3. 联邦'),
    (
        'communicate',
        'v. 1. 传达(意见、消息等)，传播，传送 2. 传染(疾病) 3. (房间)相连，相通'
    ),
    (
        'communication',
        'n. 1. 通信，通讯 2. 传达的信息 3. (pl)通讯系统 4. 交通，交通工具'
    ),
    (
        'community',
        'n. 1. 团体，社区，(政治)共同体 2. 同一地区的全体居民，公众'
    ),
    (
        'commute',
        'v. 1. 定时往返两地 2. 减轻(刑罚) 3. 用…交换，改变(付款)方式'
    ),
    ('compact', 'adj. 1. 紧密的，结实的 2. (文体)简洁的，紧凑的'),
    ('companion', 'n. 1. 同伴，同事 2. 志趣相同的人'),
    ('comparable', 'adj. 类似的，可相比的'),
    (
        'compare',
        'v. 1. 比较，对照 2. 比喻，比作 3. 比得上，相比 || compare to 把…比作 /compare with和…比较'
    ),
    (
        'comparison',
        'n. 1. 比较，对照 2. 比喻 || beyond comparison无法相比 / in comparison with和…相比较'
    ),
    ('compartment', 'n. 间隔(如火车车厢里的小房间)'),
    ('compatible', 'adj. 可和谐共处的，相容的，兼容的'),
    ('compel', 'v. 强迫，强求'),
    ('compensate', 'v. 补偿，酬报'),
    ('compete', 'v. 1. 比赛 2. 竞争，对抗'),
    ('competence', 'n. 能力，胜任某种工作的资格'),
    ('competitive', 'adj. 1. 竞争性的， 竞争的，有竞争力的 2. 比赛的'),
    ('compile', 'v. 编辑，汇编，编纂'),
    ('complain', 'v. 抱怨，叫屈，控诉'),
    ('complaint', 'n. 1. 怨言，不满，牢骚 2. 投诉，抱怨，诉苦 3. 疾病'),
    (
        'complement',
        'n. 1. 补充物，配给物 2. 足量，足额 3. 补助语 v. 补充，补足，使完备'
    ),
    ('complex', 'adj. 复杂的，综合的 n. 1. 综合企业 2. 一组建筑群'),
    ('complexion', 'n. 1. 肤色，气色，面色 2. 外观，形势'),
    ('complicated', 'adj. 结构复杂的，难懂的，难解的'),
    ('complication', 'n. 1. 复杂情况 2. 并发症'),
    ('compliment', 'n. 恭维，称赞 v. 称赞'),
    ('comply', 'v. 同意，遵从，依从，应允'),
    ('component', 'adj. 组成的，合成的 n. 组成部分，成分，元件'),
    ('compose', 'v. 1. 组成，构成 2. 创作，作曲 3. 使安定，使平静'),
    ('composite', 'adj. 混合成的，综合成的 n. 合成物，复合材料'),
    (
        'compound',
        'n. 1. 混合物，复合词 2. 用围墙圈起的建筑物(场地)adj. 混合的，复合的'
    ),
    ('comprehension', 'n. 理解'),
    ('comprehensive', 'adj. 1. 综合的，全面的 2. 理解的，有理解力的'),
    (
        'compromise',
        'n. 妥协，折衷办法，和解 v. 1. 妥协，互让解决，折衷处理 2. 危及，连累，遭到损害'
    ),
    ('compulsory', 'adj. 强迫的，强制的，义务的'),
    ('compute', 'v. 计算，估算'),
    ('concede', 'v. 1. (常指勉强地)承认 2. 容许，让与'),
    ('conceive', 'v. 1. 设想，想出，想象 2. 怀(胎)，怀孕'),
    (
        'concentrate',
        'v. 1. 集中，使集中于一点 2. 聚集 3. 聚精会神，集中思想'
    ),
    ('concentration', 'n. 集中，注意力'),
    ('concept', 'n. 概念，观念，思想'),
    ('conception', 'n. 1. 概念，观念，理解 2. 构想，看法 3. 受孕，妊娠'),
    (
        'concern',
        'v. 1. 涉及，影响 2. 使关心，使挂念，使担心 || as far as…be concerned关于…，至于… n. 1. (利害)关系，所关切的事 2. 关心，担心，挂念 3. 商行，企业 || show concern for关心'
    ),
    ('concise', 'adj. 简洁的，简明的'),
    ('conclude', 'v. 1. 结束 2. 推断出，断定'),
    ('condemn', 'v. 1. 谴责 2. 定罪，判处'),
    (
        'condense',
        'v. 1. (使气体)冷凝，(使)凝结 2. 使浓缩 3. 压缩，缩写(文章等)'
    ),
    (
        'conduct',
        'n. 1. 行为，品行，举动 2. 指导，引导 3. 实行，处理，经营 v. 1. 引导，带领，陪伴(游客等)，指导 2. 实施，处理，经营 3. 指挥(乐队等) 4. 传导，传(热、电等)'
    ),
    ('confer', 'v. 1. 商讨 2. 授予，颁赠(勋衔、学位等)'),
    ('conference', 'n. 1. 讨论，会谈 2. (正式的)会议，讨论会'),
    (
        'confidence',
        'n. 1. 信任 2. 信心，自信，把握 3. (向知心人)吐露的秘密，说私房话'
    ),
    ('confident', 'adj. 确信的，肯定的，自信的'),
    (
        'confidential',
        'adj. 1. 秘密的，机密的，保密的 2. 极受信任的，负责机密工作的'
    ),
    ('configuration', 'n. 构造，外形，布置，结构'),
    ('confine', 'v. 1. 幽禁，监禁 2. 限制，把…局限于'),
    ('confirm', 'v. 1. 证实，认可 2. 使坚定，加强'),
    ('conflict', 'n. 1. 斗争，战斗 2. 抵触，冲突'),
    ('conform', 'v. (使)一致，(使)符合，(使)遵照，(使)适应'),
    (
        'confront',
        'v. 1. (困难等)临头 2. (使)面对，使)面临 3. 勇敢地面对(危险等)，正视，对抗'
    ),
    ('confusion', 'n. 混乱，混乱状态，骚乱'),
    ('congress', 'n. 1. (代表)大会 2. (cap)国会，议会 3. 聚会，会议'),
    ('conscientious', 'adj. 审慎正直的，认真的，本着良心的'),
    ('conscious', 'adj. 1. 有意识的，意识到的，自觉的 2. 神志清醒的'),
    ('consecutive', 'adj. 连续的，接续的'),
    ('consensus', 'n. (意见等的)一致，一致同意，共识'),
    ('consent', 'v. 同意，答应，承诺'),
    ('consequence', 'n. 1. 结果，后果 2. 重要(性)'),
    ('consequent', 'adj. 随之而来的，由…所导致的'),
    ('consequently', 'adv. 因而，所以'),
    ('conservation', 'n. 1. 保存 2. (森林等自然资源的)保护，资源保护区'),
    (
        'conservative',
        'adj. 1. 保守的 2. 拘谨的，谨慎的 n. 1. 因循守旧者，保守者 2. 保守党党员'
    ),
    ('conserve', 'v. 节约使用，保存'),
    (
        'considerable',
        'adj. 1. 值得考虑的 2. 值得重视的，重要的 3. 相当大(或多)的'
    ),
    ('considerate', 'a. 体贴的，体谅的，考虑周到的'),
    ('consist', 'v. 1. 由…组成，由…构成 2. 在于，存在于'),
    ('consistent', 'adj. 1. 坚固的，坚实的 2. 一致的，连贯的，始终如一的'),
    ('console', 'v. 安慰，慰问 n. 仪表板，控制台，键盘之入口'),
    ('consolidate', 'v. 1. 巩固，加强 2. 综合，统一，合并'),
    ('conspicuous', 'adj. 显著的，引人注目的'),
    ('constant', 'n. 1. 坚定的，坚贞的，永恒的 2. 经常的，不断的'),
    (
        'constituent',
        'n. 1. 选民，选举人 2. 成分，要素 adj. 组成的，形成的'
    ),
    ('constitute', 'v. 构成，组成'),
    ('constitution', 'n. 1. 宪法 2. 体质，体格 3. 构造，结构'),
    ('constrain', 'v. 强迫，强制'),
    (
        'construct',
        'v. 1. 构造，建造 2. 对……进行构思 n. 1. 构想，概念 2. 建造物，构成物；构思的产物'
    ),
    (
        'consult',
        'v. 1. 找…商议 2. 找(医生)诊治 3. 翻阅，查考(书籍，地图等) || consult with和…商议'
    ),
    ('consultant', 'n. 1. 顾问，专家 2. (BrE)医院的高级顾问医师'),
    ('consume', 'v. 1. 消费，耗尽 2. 烧毁，吃光，饮尽'),
    ('consumer', 'n. 消费者'),
    ('consumption', 'n. 消费(量)，消耗'),
    (
        'contact',
        'v. 使接触，与…接触(或联系) n. 1. 接触，联系 2. 交往，交际 || make contact with sb(sth)与某人(事)交谈、会晤、取得联系'
    ),
    ('contaminate', 'v. 污染，玷污，弄脏'),
    ('contemplate', 'v. 1. 沉思，仔细考虑，意欲 2. 注视，凝视'),
    ('contempt', 'n. 轻视，轻蔑'),
    ('contend', 'v. 1. 搏斗，争斗 2. 争，竞争 3. 声称，主张'),
    ('contention', 'n. 1. 争论，争辩，论战 2. 论点，主张'),
    ('contest', 'v. 争夺，竞争'),
    ('continual', 'adj. 1. 多次重复的，频繁的 2. 持续的，不间断的'),
    ('continuity', 'n. 连贯性，连续性，持续性'),
    (
        'contract',
        'n. 契约，合同 v. 1. 订立合约，签订合同 2. 使缩小，(使)收缩 3. 得病，感染疾病'
    ),
    ('contradict', 'v. 1. 否定 2. 与…矛盾'),
    ('contradiction', 'n. 矛盾'),
    ('contrast', 'n. 对比，比照 v. 使对比，形成对照'),
    ('contribute', 'v. 1. 捐助，捐赠 2. 投稿 3. 贡献，对…作出贡献'),
    ('contribution', 'n. 1. 捐款 2. 投稿 3. 贡献'),
    ('contrive', 'v. 发明， 设计，设法做到'),
    ('controversial', 'adj. 引起争论的，有争议的'),
    ('controversy', 'n. 争论，辩论'),
    ('convene', 'v. 召集会议'),
    (
        'convenience',
        'n. 1. 便利，方便 2. 方便的时候，适当的机会 3. 便利设施'
    ),
    ('convention', 'n. 1. (传统性的)习惯 2. 代表大会，定期大会'),
    ('conventional', 'adj. 习惯的，常规的'),
    ('converge', 'v. 聚集， 集中一点，汇合'),
    ('conversion', 'n. 1. 转变，变换 2. 信仰的改变 3. 兑换'),
    (
        'convert',
        'v. 1. 改变，转变 2. 改变…的信仰 3. 兑换 n. 改变信仰的人，皈依者'
    ),
    ('convey', 'v. 1. 运输，运送 2. 传达，传递'),
    ('convict', 'v. 证明、宣判…有罪，定罪 n. 被判入狱的罪犯'),
    ('convince', 'v. 1. 使确信，使信服 2. 说服'),
    (
        'cooperative',
        'n. 合作社，合作商店(企业等) adj. 1. 合作的，协作的 2. 有合作意向的，乐意合作的'
    ),
    ('cope', 'v. (成功地)对付，应付'),
    ('cord', 'n. 1. 绳索，带子 2. 小电线 3. 键 4. 灯芯绒'),
    ('cordial', 'adj. 热情友好的，热诚的'),
    ('cork', 'n. 软木，软木塞'),
    ('corporate', 'adj. 1. 团体的，全体的 2. 公司的'),
    ('corps', 'n. 1. 特种部队，军团 2. 共同工作、活动的一群人'),
    ('corpse', 'n. 尸体'),
    ('correlate', 'n. 有相互关系的东西，相关物 v. 使有相互关系，互相有关系'),
    ('correspondent', 'n. 通信者，(新闻)通讯员，记者'),
    ('corresponding', 'a. 1. 相当的，一致的 2. 通信的'),
    ('corrode', 'v. (使)腐蚀，侵蚀'),
    (
        'corrupt',
        'adj. 1. 腐败的，贪污的 2. 腐烂的，污浊的 v. 1. 使败坏，腐蚀，使腐坏 2. 贿赂'
    ),
    ('costume', 'n. 服装，剧装，戏服'),
    ('council', 'n. 1. 理事会，委员会 2. 地方议会'),
    (
        'counsel',
        'n. 1. 辩护律师 2. (专业)意见，忠告，劝告 v. 劝告，提供意见'
    ),
    (
        'counter',
        'n. 1. 柜台 2. 筹码 adj. 1. 相反的，对立的 2. 反对的，敌意的'
    ),
    ('counterpart', 'n. 相对应的人(物)'),
    ('coupon', 'n. 优惠券，赠券，票证'),
    ('court', 'n. 1. 法院，法庭 2. (网球等)球场 v. 求爱'),
    ('courtesy', 'n. 礼节，礼貌'),
    ('coverage', 'n. 1. 报道 2. 赔偿范围，保险额 3. 范围'),
    ('coward', 'n. 怯懦，胆怯者'),
    ('cozy', 'a. 舒适的，安逸的，惬意的 v. 取悦，献殷勤'),
    ('cradle', 'n. 1. 摇篮 2. 策源地，发源地'),
    (
        'crash',
        'v. 1. 碰撞，坠落 2. 发出撞击(或爆裂)声 3. 失败，垮台，崩溃 n. 1. 碰撞， 坠落 2. 撞击声，爆裂声 3. 失败，垮台，崩溃'
    ),
    ('creation', 'n. 1. 创造，创作 2. 作品'),
    ('credible', 'adj. 可信的，可靠的'),
    (
        'credit',
        'n. 1. 信任 2. 信用，信用往来，赊欠 3. 信誉，声望，威信 4. 荣誉，光荣 5. 学分 6. (银行)存款，债权 || be a credit to 为…增光 v. 相信，信任'
    ),
    ('crew', 'n. 全体船员，全体乘务员'),
    ('crime', 'n. 罪行，罪恶'),
    ('criminal', 'adj. 犯罪的，刑事的 n. 罪犯，犯人'),
    (
        'cripple',
        'n. 跛足的人，残废人 v. 1. 使…残废 2. 使…受损害，使…丧失活动能力'
    ),
    ('crisis', 'n. 1. 危机 2. 危急存亡之际，决定性时刻，转折点'),
    (
        'crisp',
        'adj. 1. 脆的，硬而易碎的 2. 清新的，爽快的 3. 干脆明确的(态度等)'
    ),
    ('criterion', 'n. 标准，准则'),
    ('critic', 'n. 批评家，评论家'),
    (
        'critical',
        'adj. 1. 批评(性)的，评论(性)的 2. 对…表示谴责的，对…感到不满的 3. 紧要的，关键性的，危害的'
    ),
    ('criticism', 'n. 1. 评论文章，评论 2. 批评，指责，非难'),
    ('criticize', 'v. 1. 批评，非难，吹毛求疵 2. 评论，评价'),
    ('crowd', 'n. 群，人群 v. 聚集，群集'),
    ('crucial', 'adj. 极重要的，决定性的，关键性的'),
    ('crumble', 'v. 1. 弄碎，粉碎 2. 崩溃，瓦解'),
    ('crush', 'v. 1. 压碎 2. 压服，压倒 n. 1. 压碎 2. (水果的)汁'),
    ('cucumber', 'n. 黄瓜'),
    (
        'culminate',
        'v. 达到顶点(高潮)，以…告终 || culminate in达到…高峰，终于'
    ),
    (
        'culture',
        'n. 1. 文化，精神文明 2. 教养，陶冶，修养 3. 栽培，养殖，培养'
    ),
    ('cumulative', 'adj. 累积的，渐增的'),
    (
        'curb',
        'n. 1. 勒马的链条(皮带) 2. 控制，约束，抑制 v. 1. 给(马)装上勒马链，勒住(马) 2. 控制，约束，抑制'
    ),
    (
        'current',
        'adj. 1. 目前运用的，广泛流通的 2. 现在的，目前的 n. 1. 水流，气流 2. 思潮，倾向'
    ),
    ('curse', 'n. 诅咒，咒骂，骂人话 v. 诅咒，咒骂'),
    ('customary', 'adj. 习惯的，惯例的，通常的'),
    ('cute', 'adj. 娇小可爱的'),
    (
        'cycle',
        'n. 1. 周期，循环 2. (无线电)周(波) v. 1. 循环，轮转 2. 骑自行车(三轮脚踏车，机器脚踏车)'
    ),
    (
        'cylinder',
        'n. 1. 圆筒，圆柱体 2. 汽缸 3. (印刷机)滚筒 4. (左轮手枪的)旋转枪膛 5. 圆柱体体积'
    ),
    ('cynical', 'adj. 愤世嫉俗的，(对人性或动机)怀疑的'),
    ('dart', 'n. 飞镖 v. 猛冲，投掷，发射'),
    ('database', 'n. 资料库，数据库'),
    ('dazzle', 'v. 1. 使眼花，耀眼 2. 使惊奇，使倾倒 n. 闪耀，耀眼'),
    ('deadline', 'n. 截止时间(期限)'),
    ('deadly', 'adj. 致命的，势不两立的，死气沉沉的 adv. 死一般地，非常，极度'),
    (
        'dean',
        'n. 1. 教务长 2. (大学的)学院院长，系主任 v. 担任教务长(院长、系主任等)'
    ),
    ('debate', 'v. 1. 辩论，讨论 2. 考虑，盘算 n. 辩论，争论，辩论比赛'),
    ('decade', 'n. 十年，十'),
    (
        'decay',
        'v. 1. 使腐败，使腐烂 2. 使衰弱，使衰退 n. 1. 腐烂，腐朽 2. 衰退，衰败'
    ),
    ('deceive', 'v. 欺骗，欺诈'),
    (
        'decent',
        'adj. 1. 体面的，得体的，正当的 2. 严肃的，高雅的，正派的 3. 和气的，过得去的，宽容的'
    ),
    ('decimal', 'n. 小数，十进小数 adj. 小数的，十进位的'),
    ('decisive', 'adj. 1. 坚决的，果断的，有决定作用的 2. 确定的，明确的'),
    ('decorate', 'v. 装饰，装修，粉刷'),
    ('decrease', 'v. (使)减少，减弱，减轻 n. 减少，减少额'),
    ('decree', 'n. 命令，法令，判决 v. 命令，颁布命令，判定'),
    (
        'dedicate',
        'v. 1. 以…奉献 2. 为…举行落成仪式 3. 把(一生等)献给，把(时间、精力等)用于'
    ),
    ('deduce', 'v. 推论，演绎'),
    ('deduct', 'v. 扣除，减去'),
    ('deem', 'v. 认为，相信，视为'),
    (
        'default',
        'n. 1. 违约，缺席，拖欠 2. (电脑的)预设，预置(值) v. 不履行，不到场，未付(债等)'
    ),
    ('defeat', 'v. 击败，战胜，挫败 n. 击败，败北'),
    ('defect', 'n. 缺点，瑕疵; v. 背叛，变节'),
    ('defendant', 'n. 被告'),
    ('defiance', 'n. 违抗，蔑视，挑战'),
    ('deficiency', 'n. 1. 缺乏，短缺 2. 缺点，毛病'),
    ('deficit', 'n. 赤字，亏损'),
    ('define', 'v. 解释，给…下定义，确定…的范围(界限)'),
    ('definitely', 'adv. 1. 当然，一定，确定 2. (和否定词连用)对，绝对'),
    ('definition', 'n. 定义，限定，清晰'),
    (
        'definitive',
        'adj. 1. 确定的，有权威的，不能(不必)改变的 2. 决定性的'
    ),
    ('defy', 'v. 1. 违抗，蔑视 2. 激(某人)做'),
    (
        'degenerate',
        'adj. 退步的，退化的，堕落的 n. 堕落者，腐化者 v. 退化，衰败，堕落'
    ),
    ('degrade', 'v. 1. 使降级，降低，2. 有辱…的人格，使丢脸'),
    (
        'deliberate',
        'adj. 1. 有意的，故意的 2. 从容不迫的，审慎的; v. 仔细考虑，商议'
    ),
    (
        'delicate',
        'adj. 1. 易碎的，娇弱的 2. 精密的，精致的 3. 微妙的 4. 清香的，清淡的'
    ),
    ('demand', 'v. &n. 要求，请求，需求'),
    ('demonstrate', 'v. 证明，示范，参加示威游行'),
    ('denial', 'n. 否认，拒绝，抛弃'),
    ('denote', 'v. 指示，表示，意思是'),
    ('denounce', 'v. 指责，痛斥，告发'),
    ('dentist', 'n. 牙科医生'),
    ('deny', 'v. 否认，拒绝承认，不准'),
    ('depict', 'v. (用图画、文字)表示，描述，描绘'),
    ('deport', 'v. 把(外国人)驱逐出境'),
    ('depress', 'v. 1. 使消沉，使抑郁，使萧条 2. 压下，按下 3. 削弱，降低'),
    ('depression', 'n. 1. 沮丧，抑郁，萧条(期) 2. 凹地，洼地，低压(地区)'),
    ('deprive', 'v. 剥夺，使丧失，使不能做'),
    (
        'derive',
        'v. 1. 取得，得到 2. 追溯…的起源(由来)，衍生 3. 推论出，引申出'
    ),
    (
        'descend',
        'v. 1. 下降，下跌，落下 2. 递减 3. 袭击，突然访问 4. 祖传，起源于，是…的后裔'
    ),
    ('descendant', 'n. 后裔，子孙 adj. 下降的，派生的，(从祖先)传下的'),
    (
        'descent',
        'n. 1. 下降，下来 2. 下倾，斜坡 3. 血统，世袭，遗传 4. 袭击，突然的访问'
    ),
    ('describe', 'v. 1.叙述，描写，形容 2. 描绘，画，把…说成'),
    ('deserve', 'v. 应得，应受，值得'),
    (
        'design',
        'n. & v. 1. 设计，图样，图案 2. 计划，图谋，打算 3. 构思，方案'
    ),
    (
        'designate',
        'v. 1·标出，指明，称呼 2. 指派，任命 adj. 已受委派(当选)而尚未就职的，候任的'
    ),
    ('desirable', 'adj. 理想的，值得拥有的，可取的'),
    ('desire', 'n. & v. 1. 意欲，渴望，愿望 2. 要求，请求'),
    ('despise', 'v. 鄙视，蔑视，轻视'),
    ('despite', 'n. 1. 侮辱，伤害 2. 恶意，怨恨 prep. 尽管，不顾，虽然'),
    ('destination', 'n. 终点，目的地，目标'),
    ('destined', 'adj. 命中注定的，预定的'),
    ('destiny', 'n. 命运，天命'),
    ('destruction', 'n. 毁坏， 毁灭，消灭'),
    ('destructive', 'adj. 破坏(性)的，毁灭(性)的，非建设性的'),
    ('detach', 'v. 拆卸，使分离，派遣'),
    (
        'detail',
        'n. 1. 细节，琐事，详述 2. 分配，(人员的)选派 3. 选派的人(小组、分队等) || go into detail(s)详细叙述，逐一说明 /in detail①详细地②逐渐地 v. 详细说明，派遣'
    ),
    ('detain', 'v. 拘留，扣押，耽搁'),
    ('detect', 'v. 发现，查明，测出'),
    ('detection', 'n. 发现，察觉，探测'),
    (
        'detective',
        'n. 1. 侦探 2. 发现者，探测者 adj. (关于)侦探的，探测(用)的'
    ),
    ('deteriorate', 'v. 恶化，(使)变坏，退化'),
    ('deviate', 'v. 背离，偏离，越(轨)'),
    (
        'device',
        'n. 1. 装置，器具，仪器 2. 手段，策略，诡计 3. 手法，技巧，图案 || leave to one’s own devices听任…自便，让…自行发展'
    ),
    ('devise', 'v. 计划，发明，设计'),
    (
        'devote',
        'v. 奉献，把…专用于 || devote oneself to 献身于，致力于， 沉溺于'
    ),
    ('diagnose', 'v. 诊断(疾病)，判断，调查分析(问题等的)原因(性质)'),
    ('dictate', 'v. 1. 口述，(使)听写 2. 命令，强行规定 3. 支配，驱使'),
    ('differentiate', 'v. 区分，(使)不同，构成…间的差别'),
    (
        'diffuse',
        'v. 1. 扩散，(使)四散，弥漫 2. 传播，散步 adj. 1. 弥漫的，四散的 2. (文章等)冗长的'
    ),
    (
        'digest',
        'v. 1. 消化(食物) 2. (经反复思考)吸收，领悟，理解 3. 整理，压缩，节略 n. 摘要，文摘，汇编'
    ),
    (
        'dignity',
        'n. 1. 尊严，高贵，体面 2. 庄严，端庄 3.官阶，职位 || beneath one''s dignity有失某人身份(体面) /stand on one''s dignity坚持受到应有的礼遇，保持尊严'
    ),
    ('dilemma', 'n. (进退两难的)窘境，困境，进退维谷'),
    ('diligent', 'adj. 勤勉的，勤奋的，坚持不懈的'),
    (
        'dilute',
        'v. 1. 稀释，冲淡 2. 削弱，减轻 adj. 经稀释的，淡的，减弱了的'
    ),
    (
        'dim',
        'adj. 1. 暗淡的，昏暗的 2. 模糊不清的，朦胧的 3. 迟钝的，愚蠢的 v. 使暗淡，(使)变模糊，(使)失去光泽'
    ),
    ('dimension', 'n. 维数，尺寸，面积 v. 标出尺寸'),
    ('diminish', 'v. 1. 减少，(使)减小，降低 2. 贬低，使降级，削弱'),
    ('dine', 'v. 进正餐，用膳，宴请'),
    ('diploma', 'n. 毕业文凭，学位证书'),
    ('diplomat', 'n. 外交家，外交官'),
    (
        'directory',
        'n. 1. 人名地址录，工商行名录，电话号码簿 2. 董事会 3. 指南'
    ),
    ('disable', 'v. 使丧失能力，(常用被动语态)使伤残'),
    ('disaster', 'n. 1. 灾难，大祸，大不幸 2. 彻底的失败 3. 祸患'),
    ('disastrous', 'adj. 灾难性的，极不幸的，极坏的'),
    ('discard', 'v. 丢掉，舍弃'),
    ('discern', 'v. 看出，了解，识别'),
    (
        'discharge',
        'v. &n. 1. 允许…离开，释放，开除 2. 发射，击发(枪、炮等) 3. 派出，放出，发泄 4. 卸(货)，下(客) 5. 完成，履行'
    ),
    (
        'discipline',
        'n. 1. 训练，纪律，行为准则 2. 克制，规章制度，管教 3. 处罚，惩罚 4. 学科，科目 v. 训练，控制，惩罚'
    ),
    ('disclose', 'v. 1. (使)显露，揭露，泄露 2. 公开，表明，说出'),
    (
        'discount',
        'v. 怀疑地看待，漠视，低估 n. (打)折扣 || at a discount打折扣'
    ),
    ('discreet', 'adj. (言行)谨慎的，慎重的，不显眼的'),
    ('discrepancy', 'n. 差异，不符合'),
    ('discrete', 'adj. 个别的，分离的，不连续的'),
    (
        'discriminate',
        'v. 区别，辨别，有差别的对待 adj. 有区别的，有差别的，有识别力的'
    ),
    ('disease', 'n. 疾病，弊病，病害 v. 使有病，使不健全'),
    ('disguise', 'v. &n. 假扮，伪装，掩盖'),
    ('disgust', 'n. 厌恶，恶心，作呕 v. 使讨厌，使厌恶，使作呕'),
    ('dismay', 'v. (使)惊恐，使沮丧，使绝望'),
    (
        'dismiss',
        'v. 1. 免…之职，解雇 2. 让…离开，遣散 3. 不理会，抛弃，不认真考虑'
    ),
    (
        'disorder',
        'n. 1. 杂乱，混乱 2. 散乱，骚动 3. 失调，不适 v. 1. 使零乱，扰乱 2. 使失调，使不适'
    ),
    ('dispatch', 'v. 派遣 n. 派遣，急件'),
    ('disperse', 'v. (使)分散，驱散，疏散'),
    ('displace', 'v. 1. 移置，使脱离正常位置 2. 替代'),
    ('display', 'v. 陈列，展示，展览'),
    (
        'disposal',
        'n. 1. 清除，销毁，丢掉 2. 处置，处理，布置 || at sb’s disposal; in sb’s disposal任某人处理，任某人支配'
    ),
    (
        'dispose',
        'v. 1. 排列，配置 2. 清除，销毁 3. 安排，处理 4. 使倾向于 ||dispose of①丢掉，清除②赠送，卖掉③处理，解决'
    ),
    ('disposition', 'n. 性格，性情'),
    ('disregard', 'v. &n. 不理会，不顾，忽视'),
    ('disrupt', 'v. 扰乱，破坏'),
    ('dissipate', 'v. 1. 散失，驱散 2. 浪费 3. 放荡'),
    ('distill', 'v. 1. 蒸馏 2. 提炼'),
    ('distinct', 'adj. 1. 不同的，个别的，单独的 2. 清晰的，分明的，确实的'),
    (
        'distinguish',
        'v. 1. 区分，辨别，认明 2. 看清，发现，听出 3. 使有区别，使具有特色 || distinguish oneself表现杰出，使受人注意'
    ),
    ('distort', 'v. 1. 扭曲，使变形 2. 歪曲，曲解 3. 使(声音、信号等)失真'),
    (
        'distract',
        'v. 1. 转移(注意力)，使分心 2. 使转变，使转向 3. 使困惑，使混乱'
    ),
    (
        'distribution',
        'n. 1. 分发，分配，配给物 2. 散布，分布 3. 销售(量)'
    ),
    ('disturbance', 'n. 1. 打扰，妨碍 2. 心神不安，烦恼 3. 混乱，骚乱'),
    ('diverse', 'adj. 不同的，多种多样的，多变化的'),
    ('diversion', 'n. 1. 转移，转向，偏离 2. 消遣，娱乐'),
    (
        'divert',
        'v. 1. 使转向，使(河流等)改道，转移…的注意力 2. 使得到消遣，给…娱乐 3. 盗用，贪污'
    ),
    ('divine', 'adj. 1. 神的，上帝的，神圣的 2. 非凡的，极好的'),
    ('divorce', 'n. &v. 1. 离婚 2. (使)分离，脱离'),
    (
        'dizzy',
        'adj. 1. 头晕目眩的，头昏眼花的，使人晕眩的 2. 不知所措的，使人困惑的 3. 愚蠢的，笨的'
    ),
    (
        'dock',
        'n. 1. 码头，船坞 2. (法庭中的)被告席，犯人栏 v. 1. 使(船)靠码头，领(船)进港 2. (宇宙飞行器)在外层空间对接'
    ),
    ('doctrine', 'n. 1. 信条，教条，主义 2. 学说，原理，教诲'),
    (
        'dodge',
        'v. 1. 躲开，闪开 2. 躲避，施计逃避义务(责任等) n. 1. 躲闪，躲避 2. 妙计，伎俩'
    ),
    (
        'dole',
        'n. 救济，救济金(物)，一小份 || on the dole接受失业救济金; v. 施舍，少量分发'
    ),
    ('dolphin', 'n. 海豚'),
    ('domain', 'n. 1. 领域，范围，范畴 2. 领土，领地，势力范围'),
    ('dome', 'n. 圆屋顶，苍弯，半球形物'),
    (
        'domestic',
        'adj. 1. 家的，家庭的，家用的 2. (动物)非野生的，驯养的 3. 国内的，国产的，自制的'
    ),
    (
        'dominant',
        'adj. 1. 占优势的，支配的，显著的 2. 占首位的，主要的 3. 居高临下的，高耸的'
    ),
    ('dominate', 'v. 1. 支配，统治，控制 2. 占首要地位 3. 俯视，耸立于'),
    ('donate', 'v. 捐赠，赠送'),
    ('donation', 'n. 捐赠，赠品，捐款'),
    (
        'doom',
        'n. 1. 命运，厄运，毁灭 2. 判决，定罪 v. 1. 注定，命定，使…的失败(毁灭等)成为必然 2. 判定，判决'
    ),
    ('doubtless', 'adv. 1. 无疑地，肯定地 2. 很可能地，公认地'),
    ('draft', 'n. 1. 草稿，初稿 2. 汇票 v. 起草，草拟'),
    ('drag', 'v. 1. 拖，拉，曳 2. 缓慢地移动，拖着脚步走 3. 把…硬拖去'),
    (
        'drain',
        'v. 1. (使)慢慢流走，排出，把…弄干 2. 喝干 3. 使精疲力竭 n. 1. 排水沟(管) 2. 消耗，(人才等)外流 || down the drain被浪费掉，化为乌有'
    ),
    ('drainage', 'n. 排水系统'),
    (
        'dramatic',
        'adj. 1. 戏剧(性)的，刺激的，激动人心的 2. 引人注目的，印象深刻的，突然的'
    ),
    ('drastic', 'adj. 激烈的，猛烈的'),
    ('drawback', 'n. 缺点，不利条件，短处'),
    ('dread', 'v. &n. 畏惧，厌恶，担忧'),
    ('dreadful', 'adj. 1. 可怕的，令人敬畏的 2. 厉害的，讨厌的，极端的'),
    (
        'drill',
        'n. 1. 钻孔机，钻头 2. 操练，训练 v. 1. 打眼，钻孔 2. 操练，训练'
    ),
    ('drought', 'n. 旱灾，干旱'),
    ('dual', 'adj. 双的，双重的'),
    ('dub', 'v. 1. 起绰号 2. (为影片)配音'),
    ('dubious', 'adj. 怀疑的，可疑的，令人怀疑的'),
    (
        'duplicate',
        'adj. &n. 完全一样(的)，复制(的)，副本(的) || in dupli-cate一式两份的(地); v. 1. 复写，复制，复印 2. 重复，使加倍'
    ),
    ('dwarf', 'n. 矮子，矮小的人(动物、植物) v. 使矮小(显得渺小)，使相形见续出'),
    (
        'dwell',
        'v. 居住，生活于，栖息 || dwell on ①老想着，详述，长谈②凝视，持续'
    ),
    ('eagle', 'n. 鹰，雕'),
    ('Easter', 'n. 复活节'),
    ('eccentric', 'adj. 古怪的，异常的 n. 古怪的人'),
    (
        'eclipse',
        'n. 日蚀，月蚀 v. 1. 遮住(天体)的光 2. 使黯然失色，使相形见绌'
    ),
    ('ecology', 'n. 生态(学)'),
    ('economic', 'adj. 1. 经济(上)的，经济学的 2. 合算的，有利可图的'),
    ('economical', 'adj. 节俭的，经济的，精打细算的'),
    (
        'economy',
        'n. 1. 经济(体系) 2. 节约，节省，简练 adj. 便宜的，经济的，二等的'
    ),
    ('edible', 'adj. 可以吃的，适合吃的'),
    (
        'effective',
        'adj. 1. 有效的，生效的 2. 给人深刻印象的，显著的 3. 真正的，实际的'
    ),
    ('efficiency', 'n. 效率，功效'),
    (
        'efficient',
        'adj. 1. 效率高的，有能力的，能胜任的 2. 有效的，直接产生结果的'
    ),
    ('ego', 'n. 自我，自负'),
    ('eject', 'v. 1. 驱逐，逐出 2. 喷出，投出，弹出'),
    (
        'elaborate',
        'adj. 1. 精心制作的，详尽阐述的，复杂的 2. 精致的; v. 详尽阐述，发挥'
    ),
    ('elapse', 'n. & v. (时间)过去，消逝'),
    (
        'elastic',
        'adj. 1. 弹 性的，有弹力的 2. 灵活的，可伸缩的 n. 橡皮带，松紧带，橡皮圈'
    ),
    ('electric', 'adj. 1. 电的，导电的，发电的 2. 令人兴奋的，刺激的'),
    ('electrical', 'adj. 与电有关的，用电的'),
    ('electrician', 'n. 电器技师，电工，电气专家'),
    ('electricity', 'n. 1. 电，电气，电学 2. 电流，电力'),
    ('electron', 'n. 电子'),
    ('electronic', 'adj. 电子的，电子仪器的'),
    ('elegant', 'adj. 优雅的，精美的，雅致的'),
    (
        'element',
        'n. 1. 要素，成分，元素 2. 自然环境，适宜的环境 3. (pl)(学科的)基本原则，原理，基础 || in one’s element很适应，得其所 /out of one’s element不适应，不得其所'
    ),
    ('elementary', 'adj. 1. 基本的，基础的，初级的 2. 容易的，简易的'),
    (
        'elevate',
        'v. 1. 抬起，升高，提高 2. 提高(嗓门等)，振奋(情绪)，提升(职位)'
    ),
    ('elicit', 'v. 诱出，探出(事实、反应等)'),
    ('eligible', 'adj. 有资格的，合适的，合格的'),
    ('eliminate', 'v. 消除，去除，淘汰'),
    ('elite', 'n. 精华，精英，中坚'),
    (
        'eloquent',
        'adj. 1. 雄辩的，有说服力的，口才好的 2. 意味深长的，明白显示出的'
    ),
    ('embark', 'v. 1. (使)上船(飞机等) 2. 从事，着手，发动'),
    ('embarrass', 'v. 1. 使窘迫，使困扰，使为难 2. 妨碍，牵累'),
    ('embed', 'v. 把…嵌入，埋入，埋置'),
    ('embody', 'v. 体现，使具体化'),
    ('emerge', 'v. 出现，露出，暴露'),
    ('emergency', 'n. 紧急情况，突然事件，非常时刻'),
    ('emotion', 'n. 1. 感情，情绪，情感 2. 激动'),
    (
        'emphasis',
        'n. 强调，重点，重要性 || lay emphasis on sth; put emphasis on sth; place emphasis on sth把重点放在…'
    ),
    ('emphasize', 'v. 强调，着重，加强'),
    ('empirical', 'adj. 以实验为根据的，非理论的'),
    ('employment', 'n. 1. 雇用 2. 职业，工作'),
    (
        'enclosure',
        'n. 1. 围栏，围墙，圈占地 2. (信函内的)附件，装入物 3. 包围，围住'
    ),
    (
        'encounter',
        'v. 1. 偶遇，邂逅 2. 遭到，突遇 n. 1. 遭遇，会战 2. 意外的相见'
    ),
    ('encourage', 'v. 1. 鼓励，激励，怂恿 2. 赞助，支持，促进'),
    ('endeavor', 'n. 努力，尝试 v. 努力，尽力'),
    (
        'endow',
        'v. 1. 赋予，授予 2. 资助，捐赠 || be endowed with天生具有…，有…的天赋'
    ),
    ('endurance', 'n. 忍耐，耐力，持久力'),
    ('endure', 'v. 1. 忍受，忍耐，(常与否定词连用)容忍 2. 持续，持久'),
    ('energetic', 'adj. 有力的，精力旺盛的，精神饱满的'),
    (
        'enforce',
        'v. 1. 实施，执行 2. 强制，强迫 3. 加强，坚持(要求、主张等)'
    ),
    (
        'engage',
        'v. 1. (使)从事，(使)参加，使卷入 2. 约束，保证，使订婚 3. 雇佣，聘，预订 4. 吸引，占用 5. 与…交战，啮合 || engage in从事于，使忙于'
    ),
    ('engagement', 'n. 1. 约会，约定 2. 订婚，婚约'),
    ('engine', 'n. 1. 引擎，发动机 2. 机车，火车头'),
    ('enhance', 'v. 增加，提高，增强'),
    ('enlighten', 'v. 1. 启发，开导，使摆脱偏见(迷信) 2. 指导，教育'),
    ('enormous', 'adj. 巨大的，庞大的'),
    ('enrich', 'v. 使富足，使丰富，充实'),
    ('enroll', 'v. 登记，使加入，注册'),
    ('ensue', 'v. 接着发生，随之而来'),
    ('entail', 'v. 使成为必要，需要'),
    ('entertainment', 'n. 1. 招待，款待 2. 娱乐，乐趣，文娱节目'),
    ('enthusiasm', 'n. 热情，热心，热诚'),
    ('enthusiastic', 'adj. 热情的，热心的，热烈的'),
    ('entitle', 'v. 1. 定标题，定名称，称呼 2. 给权利，给…资格'),
    ('entity', 'n. 独立存在体，实体'),
    ('entrepreneur', 'n. 企业家，创业者'),
    ('environment', 'n. 环境，周围状况'),
    ('envisage', 'v. 1. 想象，设想 2. 正视，面对'),
    ('epoch', 'n. 时代，纪元，重要时期'),
    ('equality', 'n. 平等，同等，相同'),
    ('equator', 'n. 赤道'),
    ('equip', 'v. 配备，装备，使有准备'),
    ('equivalent', 'adj. 相等的，相当的，等价的 n. 相等物，等价物'),
    ('erect', 'adj. 直立的，竖起的 v. 建造，竖立，使直起'),
    ('erosion', 'n. 侵蚀，腐蚀'),
    ('erroneous', 'adj. 错误的'),
    ('erupt', 'v. 1. (火山、喷泉等)喷发，喷出，迸发 2. 爆发，突然发生'),
    ('escort', 'n. 护卫队，护送者，陪伴 v. 护送，护卫，护航'),
    ('essence', 'n. 1. 本质，实质，要素 2. 精髓，精华 3. 香精，香料'),
    (
        'essential',
        'adj. 1. 必要的，必不可少的 2. 本质的，实质的，基本的 n. 1. (pl) 必需品，必要的东西 2. 本质，要素'
    ),
    (
        'establish',
        'v. 1. 建立，设立，制订 2. 安置，安顿，确立 3. 确定，证实，规定 4. 使开业，使处于(某种位置、状况等)'
    ),
    ('esthetic', 'a. 审美的，感觉的'),
    ('estimate', 'v. 估计，估计…的意义(价值),评价 n. 估计，估算，评价，评估'),
    ('eternal', 'adj. 永远(不变)的，永恒的'),
    ('ethnic', 'adj. 种族的，部族的，少数民族的'),
    ('evaluate', 'v. 评价，估计'),
    ('evidence', 'n. 1. 根据，证据，证明 2. 证词'),
    ('evident', 'adj. 明显的，明白的'),
    (
        'evil',
        'n. 1. 邪恶，罪恶，恶行 2. 不幸，不吉，灾难 adj. 1. 坏的，邪恶的，罪恶的 2. 有 害的，中伤的，恶毒的 3. 不幸的，不吉的，不祥的'
    ),
    ('evoke', 'v. 引起，唤起，引发'),
    ('evolution', 'n. 1. 进展，发展，演变 2. 进化，演化'),
    ('exaggerate', 'v. 夸张，夸大其词'),
    ('exceed', 'v. 1. 超越，超出，比…大 2. 凌驾，优于，胜过'),
    ('exception', 'n. 1. 例外，除外 2. 反对，异议'),
    ('exceptional', 'adj. 1. 异常的，独特的，例外的 2. 优越的，杰出的'),
    (
        'excess',
        'n. 1. 过多，过剩，过度 2. 过分，无节制 3. 超过，超越，超额量 adj. 过量的，过多的，额外的'
    ),
    ('excessive', 'adj. 过多的，过分的，过度的'),
    (
        'exchange',
        'v. 1. 交换，调换，把…换成 2. 互换，兑换 n. 1. 交换，互换，交 流 2. 交火，争吵 3. 交换所，交易所'
    ),
    ('exclaim', 'v. (由于惊讶、痛苦、愤怒、高兴等)呼喊，惊叫，大声说'),
    ('exclude', 'v. 排除，对…不予考虑，把…拒之门外'),
    ('exclusive', 'adj. 1. 除外的，排外的 2. 专有的，独占的，惟一的'),
    ('excursion', 'n. 郊游，远足，游览'),
    ('execute', 'v. 1. 实行，实施，执行 2. 处死'),
    ('execution', 'n. 1. 实行，实施，执行 2. 死刑，处死刑'),
    (
        'executive',
        'adj. 1. 执行的，实施的 2. 行政的，经营管理的 n. 1. 行政部门，(工会、党派等的)执行委员会 2. 执行者，行政人员，经理'
    ),
    ('exemplify', 'v. 是…的榜样，举例说明'),
    ('exempt', 'adj. 被免除义务(责任)的，被赦免的 v. 免除，赦免'),
    (
        'exert',
        'v. 1. 运用，行使，发挥(影响等) 2. 用力，尽力 ||exert oneself努力，尽力'
    ),
    (
        'exhaust',
        'v. 1. 用完，耗尽，花光 2. 排空，抽完 3. 使筋疲力尽 4. 详尽论述 n. 1. 排气管，排气装置 2. 排出，放出 3. 废气，废液'
    ),
    (
        'exhibit',
        'v. 1. 展览，展出，陈列 2. 表现，显出，显示 n. 陈列品，展览，展览品'
    ),
    ('exile', 'v. 流放，放逐，流亡 n. 1. 流放，放逐 2. 亡命者，流放者'),
    (
        'existence',
        'n. 1. 存在，生存，生活方式 2. 发生 || come into existence出现，成立，产生'
    ),
    ('exotic', 'adj. 23. 珍奇的，奇异的，外国产的'),
    ('expand', 'v. 1. 扩大，发展，增长 2. 张开，展开'),
    ('expansion', 'n. 1. 扩张，膨胀 2. 张开，伸展 3. 扩大，扩充，发展'),
    ('expedition', 'n. 1. 探险，远征 2. 远征军，探险队'),
    ('expel', 'v. 驱逐，开除，排出(气等)'),
    ('expend', 'v. 花费，用光'),
    ('expenditure', 'n. 1. 经费，费用 2. 支出，消耗，花费'),
    (
        'expense',
        'n. 1. 费用，消费，支出 2. (精力、时间等的)消耗，耗费 3. (pl)开支，花费 || at the expense of以…为代价，由…付费'
    ),
    ('expert', 'n. 专家，能手 adj. 熟练的，内行的，专家的'),
    ('expertise', 'n. 专门技能(知识)'),
    ('expire', 'v. 1. 期满，终止 2. 死亡 3. 呼出，吐气'),
    ('explicit', 'a. 详述的，清楚的，直言的'),
    (
        'exploit',
        'v. 1. 开拓，开发，开采 2. 利用，剥削 n. 英勇(冒险)的行为(事迹)，功勋'
    ),
    ('explore', 'v. 1. 探究，探索 2. 勘探，探险，探测'),
    (
        'expose',
        'v. 1. 揭露，暴露，曝光 2. 使无遮蔽，使遭受，使处于…作用(影响)下 3. 陈列，使被看到'
    ),
    ('exposition', 'n. 1. 解释，讲解，说明 2. 展出，展览会'),
    (
        'expression',
        'n. 1. 表示，表达(方式)，词语 2. 表情，神色 3. 表露，体现'
    ),
    ('exquisite', 'adj. 精美的，精致的，精湛的'),
    ('extensive', 'adj. 1. 广阔的，广泛的，广大的 2. 全面的，彻底的，大量的'),
    (
        'extent',
        'n. 1. 范围，广度，长度 2. 程度，限度 || to some extent在某种程度上'
    ),
    ('external', 'adj. 1. 外部的，外面的，外表的 2. 外来的，外界的，对外的'),
    (
        'extinct',
        'adj. 1. 灭绝的，绝种的 2. (火山)死的，熄灭的 3. 消亡的，破灭的'
    ),
    ('extinguish', 'v. 1. 熄灭，扑灭 2. 破灭，幻灭，使消亡 3. 压制，压抑'),
    (
        'extract',
        'v. 1. 拔出，拉出，得到 2. 榨取，提取，吸取，提取物，精，汁 n. 节录，引文，选段'
    ),
    (
        'extraordinary',
        'adj. 1. 非常的，特别的，破例的 2. 离奇的，使人惊奇的，非凡的'
    ),
    ('extravagant', 'adj. 1. 浪费的，奢侈的 2. 过度的，放肆的'),
    (
        'extreme',
        'adj. 1. 末端的，极端的，尽头的 2. 极度的，偏激的，过分的 n. 极端，极度(状态)，过分'
    ),
    ('fabric', 'n. 1. 织物，织品 2. 质地，构造，结构'),
    ('fabricate', 'v. 捏造，编造，虚构'),
    ('facet', 'n. 1. (宝石等的)琢面 2. (事物等的)一面，方面'),
    ('facilitate', 'v. 使容易，使便利，促进'),
    ('factor', 'n. 因素，要素'),
    (
        'faculty',
        'n. 1. 天赋，才能，官能 2. (大学的)系、科，学院 3. (院系的)全体教师，(某一职业的)全体从业人员'
    ),
    (
        'faith',
        'n. 1. 信任，信念 2. 信仰，信条 3. 信义，诚意，忠诚 4. 保证，诺言，约定 || have faith in信任'
    ),
    ('fake', 'n. 假货，赝品，骗人诡计 adj. 假的，冒充的 v. 伪造，假装，捏造'),
    ('famine', 'n. 饥荒') ON CONFLICT (LOWER(term)) DO NOTHING;